{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-TASK",
    "2": "I-TASK",
    "3": "B-DEADLINE",
    "4": "I-DEADLINE",
    "5": "B-RECIPIENT",
    "6": "I-RECIPIENT"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DEADLINE": 3,
    "B-RECIPIENT": 5,
    "B-TASK": 1,
    "I-DEADLINE": 4,
    "I-RECIPIENT": 6,
    "I-TASK": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.43.3",
  "vocab_size": 30522
}
